### Terraform :rocket:
#### Terraform init
```bash
Initializing the backend...

Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for aca_cocktails_mcp...
- aca_cocktails_mcp in .terraform/modules/aca_cocktails_mcp/modules/container-app
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for apim_cocktails_mcp...
- apim_cocktails_mcp in .terraform/modules/apim_cocktails_mcp/modules/apim-api
Initializing provider plugins...
- Finding hashicorp/azuread versions matching "3.1.0"...
- Finding latest version of hashicorp/random...
- Finding hashicorp/azurerm versions matching "4.24.0"...
- Installing hashicorp/azuread v3.1.0...
- Installed hashicorp/azuread v3.1.0 (signed by HashiCorp)
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)
- Installing hashicorp/azurerm v4.24.0...
- Installed hashicorp/azurerm v4.24.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
#### Terraform format
```bash

```
#### Terraform validate
```bash
Success! The configuration is valid.


```
#### Terraform plan
```bash
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.global_shared_resource_group: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.cocktails_global_resource_group: Reading...
data.azurerm_resource_group.global_network_resource_group: Reading...
data.azurerm_application_insights.appi: Reading...
data.azurerm_resource_group.cocktails_resource_group: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjBhZTE4MC0zNWM4LTQ1ODktYTlkMS1iNjNkOWZkYzhmZmM7b2JqZWN0SWQ9ZmZlZmFiYWMtZmRhNC00ZTVkLWFlZTUtYWZlNTBkYzdkYTkzO3N1YnNjcmlwdGlvbklkPTFkOWVjYzAwLTI0MmEtNDYwZC04YjA4LWI3MWRiMTlmMDk0ZTt0ZW5hbnRJZD1hYmM0OTBlNS0zOTViLTRkYjEtOWQ5Zi0xODQzNGE0NTI2M2Q=]
data.azurerm_resource_group.cocktails_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001]
data.azurerm_key_vault.cocktails_keyvault: Reading...
data.azurerm_resource_group.global_network_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001]
data.azurerm_subnet.container_app_environment_subnet: Reading...
data.azurerm_virtual_network.global_virtual_network: Reading...
data.azurerm_resource_group.cocktails_global_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001]
data.azurerm_dns_zone.cezzis_dns_zone: Reading...
data.azurerm_application_insights.appi: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/components/appi-vec-eus-glo-shared-001]
data.azurerm_resource_group.global_shared_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001]
data.azurerm_container_app_environment.cae_shared: Reading...
data.azurerm_container_registry.shared_acr: Reading...
data.azurerm_api_management.apim_shared: Reading...
data.azurerm_key_vault.cocktails_keyvault: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1]
data.azurerm_subnet.container_app_environment_subnet: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001/subnets/snet-vec-eus-glo-sharedcontainers-001]
data.azurerm_virtual_network.global_virtual_network: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001]
data.azurerm_dns_zone.cezzis_dns_zone: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.Network/dnsZones/cezzis.com]
data.azurerm_api_management.apim_shared: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001]
data.azurerm_container_app_environment.cae_shared: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001]
data.azurerm_container_registry.shared_acr: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ContainerRegistry/registries/acrveceusgloshared001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault_secret.cocktails_mcp_apimhostkey will be created
  + resource "azurerm_key_vault_secret" "cocktails_mcp_apimhostkey" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1"
      + name                    = "cocktails-mcp-apimhostkey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cocktails_mcp_cezzis_com_subscription_primary_key will be created
  + resource "azurerm_key_vault_secret" "cocktails_mcp_cezzis_com_subscription_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1"
      + name                    = "cocktails-mcp-cezzis-com-subscription-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "cocktails"
          + "Environment" = "prd"
          + "Owner"       = "cocktails.mcp"
          + "Product"     = "cezzis"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cocktails_mcp_devops_subscription_primary_key will be created
  + resource "azurerm_key_vault_secret" "cocktails_mcp_devops_subscription_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1"
      + name                    = "cocktails-mcp-devops-subscription-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "cocktails"
          + "Environment" = "prd"
          + "Owner"       = "cocktails.mcp"
          + "Product"     = "cezzis"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_password.cocktails_mcp_apimhostkey will be created
  + resource "random_password" "cocktails_mcp_apimhostkey" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.cocktails_mcp_cezzis_com_subscription_keys[0] will be created
  + resource "random_password" "cocktails_mcp_cezzis_com_subscription_keys" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = false
    }

  # random_password.cocktails_mcp_cezzis_com_subscription_keys[1] will be created
  + resource "random_password" "cocktails_mcp_cezzis_com_subscription_keys" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = false
    }

  # random_password.cocktails_mcp_devops_subscription_keys[0] will be created
  + resource "random_password" "cocktails_mcp_devops_subscription_keys" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = false
    }

  # random_password.cocktails_mcp_devops_subscription_keys[1] will be created
  + resource "random_password" "cocktails_mcp_devops_subscription_keys" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = false
    }

  # random_password.cocktails_mcp_localusage_subscription_keys[0] will be created
  + resource "random_password" "cocktails_mcp_localusage_subscription_keys" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = false
    }

  # random_password.cocktails_mcp_localusage_subscription_keys[1] will be created
  + resource "random_password" "cocktails_mcp_localusage_subscription_keys" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = false
    }

  # module.aca_cocktails_mcp.azurerm_container_app.aca will be created
  + resource "azurerm_container_app" "aca" {
      + container_app_environment_id  = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + max_inactive_revisions        = 5
      + name                          = "aca-vec-eus-prd-cocktailsmcp-001"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-vec-eus-prd-cocktails-001"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Application" = "cocktails"
          + "Environment" = "prd"
          + "Owner"       = "cocktails.mcp"
          + "Product"     = "cezzis"
        }
      + workload_profile_name         = "Consumption"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = (known after apply)
          + server   = "acrveceusgloshared001.azurecr.io"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas                     = 1
          + min_replicas                     = 1
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "acrveceusgloshared001.azurecr.io/cocktailsmcp:c44a03c5240b9a60cb387340690c5de10158dbf1"
              + memory            = "0.5Gi"
              + name              = "cocktails-mcp"

              + env {
                  + name  = "AZURE_CLIENT_ID"
                  + value = (known after apply)
                }
              + env {
                  + name  = (sensitive value)
                  + value = (sensitive value)
                }
              + env {
                  + name  = (sensitive value)
                  + value = (sensitive value)
                }
              + env {
                  + name  = (sensitive value)
                  + value = (sensitive value)
                }
              + env {
                  + name        = "CocktailsMcp__ApimHostKey"
                  + secret_name = "apim-host-key"
                }

              + startup_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 0
                  + interval_seconds                 = 10
                  + path                             = "/api/v1/health/ping?type=startup_probe"
                  + port                             = 8080
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 10
                  + transport                        = "HTTP"
                }
            }
        }
    }

  # module.aca_cocktails_mcp.azurerm_key_vault_access_policy.aca_keyvault_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "aca_keyvault_policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
        ]
      + key_vault_id       = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "abc490e5-395b-4db1-9d9f-18434a45263d"
    }

  # module.aca_cocktails_mcp.azurerm_role_assignment.aca_user_identity_acr_role_assignment will be created
  + resource "azurerm_role_assignment" "aca_user_identity_acr_role_assignment" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ContainerRegistry/registries/acrveceusgloshared001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aca_cocktails_mcp.azurerm_user_assigned_identity.aca_user_identity will be created
  + resource "azurerm_user_assigned_identity" "aca_user_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "mi-vec-eus-prd-cocktailsmcp-001"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-vec-eus-prd-cocktails-001"
      + tags                = {
          + "Application" = "cocktails"
          + "Environment" = "prd"
          + "Owner"       = "cocktails.mcp"
          + "Product"     = "cezzis"
        }
      + tenant_id           = (known after apply)
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api.apim_api_version will be created
  + resource "azurerm_api_management_api" "apim_api_version" {
      + api_management_name   = "apim-vec-eus-glo-shared-001"
      + api_type              = "http"
      + display_name          = "Prd Cocktails Mcp"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "prd-cocktails-mcp-v1"
      + path                  = "prd/cocktails/mcp"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "rg-vec-eus-glo-shared-001"
      + revision              = "v1"
      + service_url           = (known after apply)
      + subscription_required = true
      + version               = "v1"
      + version_description   = "Prd Cocktails Mcp v1"
      + version_set_id        = (known after apply)

      + subscription_key_parameter_names {
          + header = "X-Key"
          + query  = "x-key"
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_diagnostic.apim_api_diagnostic[0] will be created
  + resource "azurerm_api_management_api_diagnostic" "apim_api_diagnostic" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "apim-vec-eus-glo-shared-001"
      + api_name                  = "prd-cocktails-mcp-v1"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + operation_name_format     = "Name"
      + resource_group_name       = "rg-vec-eus-glo-shared-001"
      + sampling_percentage       = 5
      + verbosity                 = "information"

      + backend_request (known after apply)

      + backend_response (known after apply)

      + frontend_request {
          + body_bytes     = 32
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_response {
          + body_bytes     = 32
          + headers_to_log = [
              + "content-length",
              + "content-type",
              + "origin",
            ]
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/cocktails"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + description         = "Gets a list of cocktails"
      + display_name        = "Get Cocktails List"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-cocktails-list"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/cocktails"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/cocktails/{id}"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + description         = "Gets a cocktail recipe by id"
      + display_name        = "Get Cocktail"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-cocktail"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/cocktails/{id}"

      + request (known after apply)

      + response {
          + status_code = 200
        }

      + template_parameter {
          + name     = "id"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/health/ping"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + description         = "Get health ping"
      + display_name        = "Get Ping"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-ping"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/health/ping"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/health/version"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + description         = "Get version"
      + display_name        = "Get Version"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-version"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/health/version"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/legal/documents/privacy-policy"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + description         = "Gets the privacy policy"
      + display_name        = "Get Privacy Policy"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-privacy-policy"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/legal/documents/privacy-policy"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/legal/documents/terms-of-service"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + description         = "Gets the terms of service"
      + display_name        = "Get Terms Of Service"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "v1-get-get-terms-of-service"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/legal/documents/terms-of-service"

      + request (known after apply)

      + response {
          + status_code = 200
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_PUT_/cocktails"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_version_operations" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + description         = "Puts the list of cocktails"
      + display_name        = "Put Cocktails List"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "v1-put-put-cocktails-list"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url_template        = "/cocktails"

      + request (known after apply)

      + response {
          + status_code = 204
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/cocktails"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-cocktails-list"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-mcp-backend" />
                      <include-fragment fragment-id="prd-cocktails-mcp-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/cocktails/{id}"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-cocktail"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-mcp-backend" />
                      <include-fragment fragment-id="prd-cocktails-mcp-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/health/ping"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-ping"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-mcp-backend" />
                      <include-fragment fragment-id="prd-cocktails-mcp-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/health/version"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-version"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-mcp-backend" />
                      <include-fragment fragment-id="prd-cocktails-mcp-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/legal/documents/privacy-policy"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-privacy-policy"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-mcp-backend" />
                      <include-fragment fragment-id="prd-cocktails-mcp-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/legal/documents/terms-of-service"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-get-get-terms-of-service"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-mcp-backend" />
                      <include-fragment fragment-id="prd-cocktails-mcp-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_PUT_/cocktails"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_version_operations_policy" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + id                  = (known after apply)
      + operation_id        = "v1-put-put-cocktails-list"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + xml_content         = <<-EOT
            <policies>
                    <inbound>
                      <set-backend-service backend-id="prd-cocktails-mcp-backend" />
                      <include-fragment fragment-id="prd-cocktails-mcp-cors-policy" />
                    </inbound>
                    <backend><base /></backend>
                    <outbound><base /></outbound>
                    <on-error><base /></on-error>
                  </policies>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_api_version_set.apim_api_version_set will be created
  + resource "azurerm_api_management_api_version_set" "apim_api_version_set" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + display_name        = "Prd Cocktails Mcp"
      + id                  = (known after apply)
      + name                = "prd-cocktails-mcp"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + versioning_scheme   = "Segment"
    }

  # module.apim_cocktails_mcp.azurerm_api_management_backend.apim_api_backend will be created
  + resource "azurerm_api_management_backend" "apim_api_backend" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + id                  = (known after apply)
      + name                = "prd-cocktails-mcp-backend"
      + protocol            = "http"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + url                 = (known after apply)

      + credentials {
          + header = {
              + "X-Apim-Host-Key" = "{{prd-cocktails-mcp-apimhostkey}}"
            }
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_logger.apim_appinsights_logger will be created
  + resource "azurerm_api_management_logger" "apim_appinsights_logger" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + buffered            = true
      + description         = "Prd cocktails app insights logger for the api management instance"
      + id                  = (known after apply)
      + name                = "prd-cocktails-appinsights-logger"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + resource_id         = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/components/appi-vec-eus-glo-shared-001"

      + application_insights {
          + instrumentation_key = (sensitive value)
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_named_value.apim_api_backend_named_value_apimhostkey will be created
  + resource "azurerm_api_management_named_value" "apim_api_backend_named_value_apimhostkey" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + display_name        = "prd-cocktails-mcp-apimhostkey"
      + id                  = (known after apply)
      + name                = "prd-cocktails-mcp-apimhostkey"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + secret              = true

      + value_from_key_vault {
          + secret_id = (known after apply)
        }
    }

  # module.apim_cocktails_mcp.azurerm_api_management_policy_fragment.apim_api_b2c_policy_fragment will be created
  + resource "azurerm_api_management_policy_fragment" "apim_api_b2c_policy_fragment" {
      + api_management_id = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001"
      + format            = "xml"
      + id                = (known after apply)
      + name              = "prd-cocktails-mcp-b2c-policy"
      + value             = <<-EOT
            <fragment>
                      <validate-jwt header-name="Authorization" failed-validation-httpcode="401" failed-validation-error-message="Unauthorized. Access token is missing or invalid.">
                          <openid-config url="https://.b2clogin.com/.onmicrosoft.com//v2.0/.well-known/openid-configuration" />
                          <audiences>
                              <audience></audience>
                          </audiences>
                          <issuers>
                              <issuer>https://.b2clogin.com//v2.0/</issuer>
                          </issuers>
                      </validate-jwt>
                  </fragment>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_policy_fragment.apim_api_cors_policy_fragment will be created
  + resource "azurerm_api_management_policy_fragment" "apim_api_cors_policy_fragment" {
      + api_management_id = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001"
      + format            = "xml"
      + id                = (known after apply)
      + name              = "prd-cocktails-mcp-cors-policy"
      + value             = <<-EOT
            <fragment>
                    <cors allow-credentials="true">
                      <allowed-origins>
                        
                      </allowed-origins>
                      <allowed-methods>
                        <method>*</method>
                      </allowed-methods>
                      <allowed-headers>
                        <header>*</header>
                      </allowed-headers>
                    </cors>
                  </fragment>
        EOT
    }

  # module.apim_cocktails_mcp.azurerm_api_management_product.apim_api_product will be created
  + resource "azurerm_api_management_product" "apim_api_product" {
      + api_management_name   = "apim-vec-eus-glo-shared-001"
      + approval_required     = true
      + display_name          = "Prd Cocktails Mcp"
      + id                    = (known after apply)
      + product_id            = "prd-cocktails-mcp"
      + published             = true
      + resource_group_name   = "rg-vec-eus-glo-shared-001"
      + subscription_required = true
      + subscriptions_limit   = 3
    }

  # module.apim_cocktails_mcp.azurerm_api_management_product_api.apim_api_product_api will be created
  + resource "azurerm_api_management_product_api" "apim_api_product_api" {
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + api_name            = "prd-cocktails-mcp-v1"
      + id                  = (known after apply)
      + product_id          = "prd-cocktails-mcp"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
    }

  # module.apim_cocktails_mcp.azurerm_api_management_subscription.apim_api_product_subscriptions["Prd Cezzis.Com Devops Cocktails Mcp Subscription"] will be created
  + resource "azurerm_api_management_subscription" "apim_api_product_subscriptions" {
      + allow_tracing       = false
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + display_name        = "Prd Cezzis.Com Devops Cocktails Mcp Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = "prd-cezzis-com-devops-cocktails-mcp-subscription"
    }

  # module.apim_cocktails_mcp.azurerm_api_management_subscription.apim_api_product_subscriptions["Prd Cezzis.Com LocalUsage Cocktails Mcp Subscription"] will be created
  + resource "azurerm_api_management_subscription" "apim_api_product_subscriptions" {
      + allow_tracing       = false
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + display_name        = "Prd Cezzis.Com LocalUsage Cocktails Mcp Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = "prd-cezzis-com-localusage-cocktails-mcp-subscription"
    }

  # module.apim_cocktails_mcp.azurerm_api_management_subscription.apim_api_product_subscriptions["Prd Cezzis.Com Standard Cocktails Mcp Subscription"] will be created
  + resource "azurerm_api_management_subscription" "apim_api_product_subscriptions" {
      + allow_tracing       = false
      + api_management_name = "apim-vec-eus-glo-shared-001"
      + display_name        = "Prd Cezzis.Com Standard Cocktails Mcp Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = "prd-cezzis-com-standard-cocktails-mcp-subscription"
    }

  # module.apim_cocktails_mcp.azurerm_key_vault_access_policy.apim_keyvault_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "apim_keyvault_policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
        ]
      + key_vault_id       = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1"
      + object_id          = "f5d45d58-786f-42cc-9852-6aafa7de5180"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "abc490e5-395b-4db1-9d9f-18434a45263d"
    }

Plan: 42 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "b2c_tenant_name" but a
value was found in file "environment_vars/prd.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "b2c_tenant_domain_name"
but a value was found in file "environment_vars/prd.tfvars". If you meant to
use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
Releasing state lock. This may take a few moments...

```

*This is a comment created by the terraform-plan-and-apply.yaml workflow. It will be updated if the workflow is run again.*